-- --------------------------------------------------------------------------------------------------------------------
-- 初始化部门
insert into tbl_sys_dept(`id`,`code`,`name`,`parent_id`) values(1653383210813, 1, '系统平台', 0);
-- --------------------------------------------------------------------------------------------------------------------
-- 初始化账号
insert into tbl_sys_user(`id`,`name`,`account`,`passwd`,`dept_id`)
values (1653383252813, '管理员', 'master', md5(concat('123456', 'master')), 1653383210813);
-- --------------------------------------------------------------------------------------------------------------------
-- 初始化角色
insert into tbl_sys_role(`id`,`name`,`abbr`,`data_scope`) values (1653383273813, '系统管理员', 'admin-role', 1);
-- --------------------------------------------------------------------------------------------------------------------
-- 初始化用户角色
insert into tbl_sys_user_roles(`user_id`,`role_id`) value (1653383252813, 1653383273813);
-- --------------------------------------------------------------------------------------------------------------------
-- 初始化字典类型
insert into tbl_sys_dict_type(`id`,`name`,`type`) values
(1, '性别', 'sys_gender'),
(2, '菜单状态', 'sys_show_hide'),
(3, '系统开关', 'sys_switch'),
(4, '通知类型', 'sys_notice_type'),
(5, '通知状态', 'sys_notice_status'),
(6, '系统状态', 'sys_status');
-- --------------------------------------------------------------------------------------------------------------------
-- 初始化字典数据
insert into tbl_sys_dict_data(`id`,`code`,`label`,`value`,`is_default`,`type`,`css_class`,`list_class`) values
-- 性别
(101, 1, '未知', '0', 0, 'sys_gender', '', ''),
(102, 2, '男', '1', 1, 'sys_gender', '', ''),
(103, 3, '女', '2', 0, 'sys_gender', '', ''),
-- 菜单状态
(201, 1, '显示', '1', 1, 'sys_show_hide', '', 'primary'),
(202, 2, '隐藏', '0', 0, 'sys_show_hide', '', 'danger'),
-- 系统开关
(301, 1, '正常', '1', 1, 'sys_switch', '', 'primary'),
(302, 2, '停用', '0', 0, 'sys_switch', '', 'danger'),
-- 通知类型
(401, 1, '通知', '1', 1, 'sys_notice_type', '', 'warning'),
(402, 2, '公告', '2', 0, 'sys_notice_type', '', 'success'),
-- 通知状态
(501, 1, '未读', '1', 1, 'sys_notice_status', '', 'primary'),
(502, 2, '已读', '2', 0, 'sys_notice_status', '', 'danger'),
-- 系统状态
(601, 1, '启用', '1', 1, 'sys_status', '', 'primary'),
(602, 2, '停用', '0', 0, 'sys_status', '', 'danger'),
(603, 3, '删除', '-1', 0, 'sys_status', '', 'warning');
-- --------------------------------------------------------------------------------------------------------------------
-- 初始化系统配置参数
insert into tbl_sys_config(`id`,`name`,`key`,`val`,`type`) values
(1,'主框架页-默认皮肤样式名称', 'sys.index.skinName', 'skin-blue', 1),
(2,'主框架页-侧边栏主题', 'sys.index.sideTheme', 'theme-dark', 1),
(3,'用户管理-账号初始密码', 'sys.user.initPassword', '123456', 1),
(4,'账号自助-验证码开关', 'sys.account.captchaOnOff', 'true', 1),
(5,'账号自助-是否开启用户注册功能', 'sys.account.registerUser', 'false', 1);
-- --------------------------------------------------------------------------------------------------------------------
